АлогистикТест2/src/Documents/алк_ПривязкаПакетовКАддендуму/алк_ПривязкаПакетовКАддендуму.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПривязкаПакетовКАддендуму</name>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыПоАддендумам</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Производство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>АддендумНовый</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовараНовый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АддендумСтарый</name>
    <comment>Аддендум от которого отвязываем</comment>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовараСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПакетыПоАддендумам/алк_ПакетыПоАддендумам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыПоАддендумам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_Аддендумы</name>
  <comment>Регистр показывает сколько требуется произвести и отгрузить по заказу</comment>
  <resources>
    <name>КПроизводству</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <resources>
    <name>Произведено</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_ПривязкаПакетовКАддендуму/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(АддендумНовый) И Не ЗначениеЗаполнено(АддендумСтарый) Тогда 
		Сообщить("Ошибка! Не указан аддендум(ы) для привязки/отвязки пакета.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Документы.алк_ПривязкаПакетовКАддендуму.УстановитьИдентификаторыТоваровАддендумов(ЭтотОбъект, Отказ);
			
КонецПроцедуры

Функция НайтиЭлементВМассивеСтруктур(Массив, Значение, Реквизит)
	Результат = Неопределено;
	счетчик = 0;
	Пока счетчик < Массив.Количество() Цикл
		Если Массив[счетчик][Реквизит] = Значение тогда
			Результат = Массив[счетчик];
			Прервать;
		КонецЕсли;
		счетчик = счетчик + 1;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	Движения.алк_ПакетыПоАддендумам.Записать();
	
	ОстаткиПакетов = РегистрыНакопления.алк_ОстаткиЗапасов.ПолучитьСтруктуруОстатковПакетов(СерийныйНомер, Дата);
	Движения.алк_Аддендумы.Записывать = Истина;
	Движения.алк_ПакетыПоАддендумам.Записывать = Истина;
	
	НайденнаяЗаписьПоСерийномуНомеру = НайтиЭлементВМассивеСтруктур(ОстаткиПакетов, СерийныйНомер, "СерийныйНомер");
	Если Не ЗначениеЗаполнено(НайденнаяЗаписьПоСерийномуНомеру) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтрШаблон("Не проведен документ %1. Не обнаружены остатки по пакету № %2.", Ссылка, СерийныйНомер)
			, Ссылка
			,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ОбъемПакета = НайденнаяЗаписьПоСерийномуНомеру.Количество;
	
	Если ЗначениеЗаполнено(АддендумНовый) тогда
		Движение = Движения.алк_Аддендумы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Аддендум = АддендумНовый;
		Движение.ИдентификаторТовара = ИдентификаторТовараНовый;
		Движение.КПроизводству = ОбъемПакета;
		Движение.Произведено = ?(Производство,  -ОбъемПакета, 0);  // минус т.к. вид движения расход 
	КонецЕсли;
	Если ЗначениеЗаполнено(АддендумСтарый) тогда
		Движение = Движения.алк_Аддендумы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Аддендум = АддендумСтарый;
		Движение.ИдентификаторТовара = ИдентификаторТовараСтарый;
		Движение.КПроизводству = ОбъемПакета;
	КонецЕсли;
	
	Для каждого СоставПакета из НайденнаяЗаписьПоСерийномуНомеру.МассивПараметров Цикл 
		Движение = Движения.алк_ПакетыПоАддендумам.Добавить();
		Движение.Период = Дата;
		Движение.СерийныйНомер = СерийныйНомер;
		Движение.ПоОтгрузке = Ложь;
		Движение.Аддендум = АддендумНовый;
		Движение.ИдентификаторТовара = ИдентификаторТовараНовый;
		Движение.Ответственный = Ответственный;
		Движение.Номенклатура = СоставПакета.Номенклатура;
		Движение.Характеристика = СоставПакета.Характеристика;
		Движение.Количество = СоставПакета.Количество;
	КонецЦикла;	
	
	//РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_Аддендумы", Отказ, РежимЗаписиДокумента.Проведение);
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//пересчитываем для двух
	Если  ЗначениеЗаполнено(АддендумНовый) И ЗначениеЗаполнено(АддендумСтарый) Тогда 
		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.РФП_AlogistK_ERP.НайтиПоКоду("ЕРП"),АддендумНовый); 
		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.РФП_AlogistK_ERP.НайтиПоКоду("ЕРП"),АддендумСтарый);
	Иначе   //иначе только один регистрируем
		Если Не ЗначениеЗаполнено(АддендумНовый) Тогда 
			Адд = АддендумСтарый;
		Иначе 
			Адд = АддендумНовый;
		КонецЕсли;
		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.РФП_AlogistK_ERP.НайтиПоКоду("ЕРП"),Адд); 
	КонецЕсли;
КонецПроцедуры
